[
    {
        "title":"How should I prepare my house before selling it?",
        "blog":"First impressions matter in business, but especially in real estate. Anyone walking through a house or touring it virtually will be looking for ways to pass or negotiate down on the price. You must help clients make sure that the HVAC, plumbing, and electrical system all work properly. Each room should look clean and decluttered with no overt damage insight."
    },
    {
        "title":"Should I order a home inspection?",
        "blog":"Getting a pre-sale home inspected is never a bad idea, especially to get your client the best price for their home. Some homebuyers will feel uncomfortable purchasing a house without seeing a home inspection. Many will often hire their own inspector. It’s better to be safe than sorry."
    },
    {
        "title":"How long will it take to sell my home?",
        "blog":"Once the house is on the market, it may take anywhere from four to six weeks to sell. However, if the market is fairly hot, a seller could see their house off the market within a week. On the flip side, if there is a lull in the market or issues arise such as negotiation, lack of exposure, or house conditions then the property can sit on the market for months."
    },
    {
        "title":"What is the selling price of my home?",
        "blog":"The selling price of a house fluctuates depending on multiple factors. The most common ones are the neighborhood and what similar-sized houses are currently selling for. Also, look at the age and condition. Do major repairs need to be done? If so, that might lower the property. And again, the market matters. Like everything else, home prices vary depending on supply and demand. Your job as a realtor is to best inform your clients about these different factors and accurately list their house."
    },
    {
        "title":"Is there a reason my home’s assessed value differs compared to the market value?",
        "blog":"A public tax assessor gives the assessed value for a property. This assessment typically occurs yearly for taxation purposes. The fair market value is an agreed-upon price between a willing buyer and seller. There is usually a difference between the assessed value and market value. For homeowners, the assessed value is a double-edged sword. Because, if their annual assessed value increased then their yearly taxes will also be raised. On the flip side, when selling a house it can help boost its market value."
    },
    {
        "title":" What is an agent’s commission fee?",
        "blog":"In a real estate transaction, the agent is usually paid by the seller via commission as opposed to a flat free. Typically, a real estate commission fee is 5–6% of the home’s final sale price. In many cases, both the buyer’s agent and the seller’s agent split the commission fee 50/50. Both receiving 2.5–3%. As a broker or agent, you can use this easy to use real estate commission calculator to determine your commission fee. Also, know that some real estate agencies will work at a discounted rate of around 3% or for a flat service fee. The discounted rate and flat fee can be cheaper, but can also result in a lower quality of service."
    },
    {
        "title":"Are real estate prices negotiable?",
        "blog":"Yes, almost everything in real estate is negotiable. Typically, there is a difference between a home’s list price and how much it actually sells for. The current market’s saturation will determine how much wiggle room there is for negotiation. If you’re on the buyer’s side, expect the house to be able to be purchased for less if there is a lower demand than supply in the market. Vice versa, if you’re on the seller’s side expect it to usually sell for less. That being said, you never know who else is house hunting. Sometimes people will swoop in and offer the exact asking price."
    },
    {
        "title":" What is the first step in buying a home?",
        "blog":"The absolute first step for your client is to get approved for a mortgage. Without being approved for a mortgage it will be quite difficult, if not impossible, to purchase a new home. If a potential client reaches out to you, have them go through the tenant screening process and then guide them to a reputable mortgage corporation and advisor that you trust."
    },
    {
        "title":"Should I sell my current property before buying a new one?",
        "blog":"This is a tricky question, and the answer primarily depends on one’s funds and ability to find temporary housing. If a client needs more equity to purchase a new home or meet a mortgage plan, then it is best to sell one’s current home before purchasing their next one. That being said, they will most likely need temporary housing at a friend or relatives, or by arranging a short-term rental elsewhere."
    },
    {
        "title":"Should I do a home inspection?",
        "blog":"Yes, either order a home inspection for your client or have them order one. A home inspection is one of the most vital steps when purchasing a property. A professional inspector has a keen eye for how well the house has been taken care of. The inspectors can comment on structural and cosmetic issues, along with any local code issues. Moreover, a home inspector will help you better determine the home’s value."
    },
    {
        "title":"Should I do a final walk-through?",
        "blog":"A final walk-through is not required but highly recommended. Final walk-throughs give buyers a chance to make sure nothing has changed since their initial inspection or previous visits. Also, if repairs were requested as part of the sale offer then a follow-up visit ensures all repairs are done according to the agreement and contract."
    },
    {
        "title":"How does earnest money work?",
        "blog":"Earnest money is similar to a deposit when renting a place. It is made in good faith to demonstrate to the seller that the buyer’s offer is legitimate. As a real estate agent, you should ask your client for the earnest money as a deposit in the form of a check or cash. The amount is usually 1-2% of the selling price and essentially takes the property off the market. The money also gives the buyer extra time to conduct a title search, get an inspection and property appraisal, and financing."
    }
]